golfstore/app/controllers/items_controller.rb

  def index
    @items = Item.all
---
SELECT "items".* FROM "items"  WHERE (title LIKE '%b%')  ORDER BY created_at DESC

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("brand", "category", "created_at", "description", "image_url", "price", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)